In [2]:
import pandas as pd

In [3]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 32],
    'City': ['New York', 'Paris', 'Berlin', 'London']
}

# converting into a table will be easier to read

## Creating DataFrame

In [6]:
df = pd.DataFrame(data)

# index is automatically added with pandas

### Filtering columns

sql:

SELECT Name
FROM df

In [7]:
df['Name']

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

### First two rows

SELECT *
FROM df
LIMIT 2;

In [ ]:
df.head(2) # head is like limit (sql)

# head's default is first 5 rows

   Name  Age      City
0  John   28  New York
1  Anna   34     Paris

In [ ]:
# object of n dimension array
# not a normal string, numpy str

In [ ]:
df.info() # info method

# tells you everything about df (summary) -> datatypes, constraints
# str is marked as object -> all strings are objects (pandas doesn't understand what str is)
# 4 entries (rows) , 3 columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [ ]:
df
df.shape # (rows, columns)
# output (4 rows, 3 columns -> don't include index)

(4, 3)

In [11]:
df.dtypes # datatypes

Name    object
Age      int64
City    object
dtype: object

In [12]:
df.columns # only shows columns

Index(['Name', 'Age', 'City'], dtype='object')

In [ ]:
df.describe() # for integer columns, shows all functions (count, mean, std, etc.)
# behind the scenes: np.mean(df)
# doesn't make sense to do with objects also

             Age
count   4.000000
mean   30.750000
std     2.753785
min    28.000000
25%    28.750000
50%    30.500000
75%    32.500000
max    34.000000

In [ ]:
df.describe(include="all") # Force all the columns

# top -> most repeated
# extra rows: unique, top, freq
# Age -> unique, top, freq == NaN (doesn't make sense for int)

        Name        Age      City
count      4   4.000000         4
unique     4        NaN         4
top     John        NaN  New York
freq       1        NaN         1
mean     NaN  30.750000       NaN
std      NaN   2.753785       NaN
min      NaN  28.000000       NaN
25%      NaN  28.750000       NaN
50%      NaN  30.500000       NaN
75%      NaN  32.500000       NaN
max      NaN  34.000000       NaN